{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": [
    "medicare-insurance",
    "annuities",
    "disability-insurance",
    "renters-insurance",
    "auto-insurance",
    "life-insurance",
    "home-insurance",
    "health-insurance",
    "critical-illness-insurance",
    "long-term-care-insurance",
    "other-insurance",
    "retirement-plans"
  ],
  "initializer_range": 0.02,
  "label2id": {
    "annuities": 1,
    "auto-insurance": 4,
    "critical-illness-insurance": 8,
    "disability-insurance": 2,
    "health-insurance": 7,
    "home-insurance": 6,
    "life-insurance": 5,
    "long-term-care-insurance": 9,
    "medicare-insurance": 0,
    "other-insurance": 10,
    "renters-insurance": 3,
    "retirement-plans": 11
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "vocab_size": 30522
}
